---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RoofConstraintOffsetParam
source: html/3e10c7e8-3abd-b593-cb27-2603323eac7b.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RoofConstraintOffsetParam Property

"Level Offset"

## Syntax (C#)
```csharp
public static ForgeTypeId RoofConstraintOffsetParam { get; }
```